src/cf/InformationRegisters/ФИОФизическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ФИОФизическихЛиц</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Инициалы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьИнициалыИмени</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ФИОСлужебные</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>120</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Documents/ТТНИсходящаяЕГАИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ТТНИсходящаяЕГАИС</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиАлкогольнойПродукцииЕГАИС</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийТТНИсходящейЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СтрокаЕГАИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторЕГАИС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СтрокаЕГАИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСтатусОбработки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыОбработкиТТНИсходящейЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрацииДвижений</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТТН</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СтрокаЕГАИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаТТН</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтгрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Грузоотправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторОрганизацийЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Грузополучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторОрганизацийЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторОрганизацийЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Упакована</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДоставки</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СтрокаЕГАИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Перевозчик</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипТранспорта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыТранспортаЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТранспортногоСредства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Прицеп</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказчик</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПунктПогрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПунктРазгрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Перенаправление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Экспедитор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаГосИСНеотрицательная</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПользователиИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьРасхождения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеТТНИсходящаяЕГАИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеПроверкиИПодбора</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусПроверкиИПодбора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПроверкиИПодбораИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеПроверкиИПодбораАктРасхождений</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусПроверкиИПодбораАктРасхождений</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПроверкиИПодбораИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТоварВПутиПринадлежитГрузополучателю</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.УникальныйИдентификаторИС</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АлкогольнаяПродукция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторАлкогольнойПродукцииЕГАИС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторУпаковки</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СтрокаЕГАИС</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Номенклатура</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СерияНоменклатуры</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ХарактеристикаНоменклатуры</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Упаковка</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоЕГАИСНеотрицательное</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоЕГАИСНеотрицательное</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоФакт</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоЕГАИСНеотрицательное</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаГосИСНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПартии</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СтрокаЕГАИС</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Справка2</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Справки2ЕГАИС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСправки2Покупателя</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СтрокаЕГАИС</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусУказанияСерий</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>АкцизныеМарки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.УникальныйИдентификаторИС</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АкцизнаяМарка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ШтрихкодыУпаковокТоваров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШтрихкодУпаковки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ШтрихкодыУпаковокТоваров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Справка2</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Справки2ЕГАИС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/CommonModules/ЭлектронноеВзаимодействиеИСМППереопределяемый/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// (См. ЭлектронноеВзаимодействиеИСМП.ЗаполнитьСведенияОМаркировке)
// Переопределяет заполнение сведений о маркировке. Установить СтандартнаяОбработка=Ложь для переопределенных вызовов.
Процедура ЗаполнитьСведенияОМаркировке(Приемник, Источник, ДанныеШтрихкодовУпаковок, СтандартнаяОбработка) Экспорт
	
	Если ТипЗнч(ДанныеШтрихкодовУпаковок) = Тип("ТаблицаЗначений")
		И ДанныеШтрихкодовУпаковок.Количество() > 0 Тогда
		
		Если ДанныеШтрихкодовУпаковок.Колонки.Найти("Ссылка") <> Неопределено Тогда
			ЕстьЧекККМ = УправлениеНебольшойФирмойЭлектронныеДокументыСервер.ЕстьЧекККМ(ДанныеШтрихкодовУпаковок[0].Ссылка);
			Если ЕстьЧекККМ = Истина Тогда // маркировки переданы в ЧЗ чеком (исключаются из УПД)
				ДанныеШтрихкодовУпаковок.Очистить();
				СтандартнаяОбработка = Ложь;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// (См. ЭлектронноеВзаимодействиеИСМП.ЗаполнитьСведенияОМаркировке_2019)
// Переопределяет заполнение сведений о маркировке. Установить СтандартнаяОбработка=Ложь для переопределенных вызовов.
Процедура ЗаполнитьСведенияОМаркировке_2019(Приемник, Источник, ДанныеШтрихкодовУпаковок, СтандартнаяОбработка) Экспорт
	
	Если ТипЗнч(ДанныеШтрихкодовУпаковок) = Тип("ТаблицаЗначений")
		И ДанныеШтрихкодовУпаковок.Количество() > 0 Тогда
		
		Если ДанныеШтрихкодовУпаковок.Колонки.Найти("Ссылка") <> Неопределено Тогда
			ЕстьЧекККМ = УправлениеНебольшойФирмойЭлектронныеДокументыСервер.ЕстьЧекККМ(ДанныеШтрихкодовУпаковок[0].Ссылка);
			Если ЕстьЧекККМ = Истина Тогда // маркировки переданы в ЧЗ чеком (исключаются из УПД)
				ДанныеШтрихкодовУпаковок.Очистить();
				СтандартнаяОбработка = Ложь;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// (См. ЭлектронноеВзаимодействиеИСМП.ЗаполнитьСведенияОМаркировке_5_02)
// Переопределяет заполнение сведений о маркировке. Установить СтандартнаяОбработка=Ложь для переопределенных вызовов.
Процедура ЗаполнитьСведенияОМаркировке_5_02(Приемник, Источник, ДанныеШтрихкодовУпаковок, СтандартнаяОбработка) Экспорт
	
	Если ТипЗнч(ДанныеШтрихкодовУпаковок) = Тип("ТаблицаЗначений")
		И ДанныеШтрихкодовУпаковок.Количество() > 0 Тогда
		
		Если ДанныеШтрихкодовУпаковок.Колонки.Найти("Ссылка") <> Неопределено Тогда
			ЕстьЧекККМ = УправлениеНебольшойФирмойЭлектронныеДокументыСервер.ЕстьЧекККМ(ДанныеШтрихкодовУпаковок[0].Ссылка);
			Если ЕстьЧекККМ = Истина Тогда // маркировки переданы в ЧЗ чеком (исключаются из УПД)
				ДанныеШтрихкодовУпаковок.Очистить();
				СтандартнаяОбработка = Ложь;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// (См. ЭлектронноеВзаимодействиеИСМП.ЗаполнитьСведенияОМаркировкеАктОРасхождениях_2019)
// Переопределяет заполнение сведений о маркировке. Установить СтандартнаяОбработка=Ложь для переопределенных вызовов.
Процедура ЗаполнитьСведенияОМаркировкеАктОРасхождениях_2019(Приемник, Источник, ДанныеШтрихкодовУпаковок, 
	ПолеКоличество, ОтборПоТипуРасхождений, ТипРасхождения, СтандартнаяОбработка) Экспорт
	
	Возврат;
	
КонецПроцедуры

// (См. ЭлектронноеВзаимодействиеИСМП.ЗаполнитьСведенияОМаркировкеУКД)
// Переопределяет заполнение сведений о маркировке. Установить СтандартнаяОбработка=Ложь для переопределенных вызовов.
Процедура ЗаполнитьСведенияОМаркировкеУКД(Приемник, Источник, ДанныеШтрихкодовУпаковокДо, ДанныеШтрихкодовУпаковокПосле, СтандартнаяОбработка) Экспорт
	
	Возврат;
	
КонецПроцедуры

// (См. ЭлектронноеВзаимодействиеИСМП.ЗаполнитьСведенияОМаркировкеУКД2020)
// Переопределяет заполнение сведений о маркировке. Установить СтандартнаяОбработка=Ложь для переопределенных вызовов.
Процедура ЗаполнитьСведенияОМаркировкеУКД2020(Приемник, Источник, ДанныеШтрихкодовУпаковокДо, ДанныеШтрихкодовУпаковокПосле, СтандартнаяОбработка) Экспорт
	
	Возврат;
	
КонецПроцедуры

// Переопределяет заполнение кодов маркировки из сведений о товаре документа ЭДО в переданные таблицы штрихкодов упаковок (факт и расхождения).
// 
// Параметры:
//  ШтрихкодыУпаковок - ТаблицаЗначений - Таблица штрихкодов для заполнения кодов из раздела Факт (См. ТаблицаШтрихкодыУпаковокНоменклатура).
//  ШтрихкодыУпаковокРасхождения - ТаблицаЗначений - Таблица штрихкодов для заполнения кодов из по расхождениям (См. ТаблицаШтрихкодыУпаковокНоменклатура).
//  СведенияОТоваре - СтрокаДереваЗначений - Строка сведений о товаре из документа ЭДО.
Процедура ДобавитьШтрихкодыТаблицыШтрихкодовАктОРасхождениях(ШтрихкодыУпаковок, ШтрихкодыУпаковокРасхождения,
		СведенияОТоваре) Экспорт
	
	Возврат;
	
КонецПроцедуры

//При записи документа ЭДО может измениться статус оформления документа, по которому происходит электронный документооборот:
//   * Для прямого обмена с ИС МП (документ "Отгрузка товаров") указание кодов маркировки требуется или в ЭДО, или в отгрузке.
//   * Подразумевается, что документ ЭДО не может изменить свой документ-основание (API ЭДО v1).
//
// Параметры:
//  ЭлектронныйДокументИсходящийОбъект - ДокументОбъект.ЭлектронныйДокументИсходящий - записываемый документ.
//  ДокументыТребующиеПересчета - Массив Из см. РасчетСтатусовОформленияИСМП.РассчитатьСтатусыОформленияДокументов - 
//   документы, связанные с записываемым электронным, для которых требуется пересчитать статус оформления.
//
Процедура ТребуетсяПересчетСтатусовОформления(ЭлектронныйДокументИсходящийОбъект, ДокументыТребующиеПересчета) Экспорт
	
	Попытка
		ИнтеграцияИСМПУНФ.ТребуетсяПересчетСтатусовОформления(ЭлектронныйДокументИсходящийОбъект, ДокументыТребующиеПересчета);
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

//Предназачена для модификации текста запроса по расчету неоформленных документов ЭДО.
//   Сценарий использования: заменить текст запроса на требуемый (требующие оформления
//   с помощью ЭДО документы продажи с маркируемой продукцией).
//
//Параметры:
//  ТекстЗапроса - Строка - Текст запроса
//
Процедура ПриПолученииТекстаЗапросаНеоформленныхДокументовЭДО(ТекстЗапроса) Экспорт
	
	ИнтеграцияИСМПУНФ.ПриПолученииТекстаЗапросаНеоформленныхДокументовЭДО(ТекстЗапроса);
	
КонецПроцедуры

// Переопределяет параметры открытия панели электронного документооборота.
//
// Параметры:
//  ПараметрыОткрытияОбработкиЭДО - Структура - Параметры открытия формы
//
Процедура ДополнитьПараметрыОткрытияПанелиЭДОИзИСМП(ПараметрыОткрытияОбработкиЭДО) Экспорт
	
	ПараметрыОткрытияОбработкиЭДО.Вставить("ОтборВходящихДокументов", Новый Массив);
	ПараметрыОткрытияОбработкиЭДО.Вставить("ОтборИсходящихДокументов", Новый Массив);
	ПараметрыОткрытияОбработкиЭДО.ОтборВходящихДокументов.Добавить(Новый Структура("Поле,ВидСравнения,Значение",
		"ЭлектронныйДокумент.СодержитМаркируемыеТовары", ВидСравненияКомпоновкиДанных.Равно, Истина));
	ПараметрыОткрытияОбработкиЭДО.ОтборИсходящихДокументов.Добавить(Новый Структура("Поле,ВидСравнения,Значение",
		"ЭлектронныйДокумент.СодержитМаркируемыеТовары", ВидСравненияКомпоновкиДанных.Равно, Истина));
	
КонецПроцедуры

// Дополнить сведения об адресах участников обмена 5_02.
// 
// Параметры:
//  СтруктураДанных              - Структура - произвольная структура данных для формирования электронного документа.
//  Источник                     - ДокументСсылка - ссылка на прикладной документ
//  СтруктураАдресов             - см. ЭлектронноеВзаимодействиеИСМП.СтруктураАдресовУчастниковОбмена
//  Отказ                        - Булево - Истина, если в процессе заполнения были обнаружены ошибки
//  ВыводитьСообщение            - Булево - Истина, если нужно выводить сообщение пользователю.
//
Процедура ЗаполнитьСведенияОбАдресахУчастниковОбмена_5_02(СтруктураДанных, Источник, СтруктураАдресов, Отказ, ВыводитьСообщение = Истина) Экспорт
	
	ВидыКИПоТипамВладельцев = Новый Соответствие;
	ВидыКИПоТипамВладельцев.Вставить(Тип("СправочникСсылка.Организации"), Справочники.ВидыКонтактнойИнформации.ФактАдресОрганизации);
	ВидыКИПоТипамВладельцев.Вставить(Тип("СправочникСсылка.Контрагенты"), Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента);
	ВидыКИПоТипамВладельцев.Вставить(Тип("СправочникСсылка.СтруктурныеЕдиницы"), Справочники.ВидыКонтактнойИнформации.ФактАдресСтруктурнойЕдиницы);
	
	ОбъектПокупатель = Неопределено;
	ОбъектПродавец   = Неопределено;
	
	ТипИсточника = ТипЗнч(Источник);
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтруктураДанных, "РеквизитыШапки") Тогда
		
		ДанныеДляФормированияЭД = СтруктураДанных;
		ДанныеШапки = СтруктураДанных.РеквизитыШапки;
		
		ДокументРеализации = Неопределено;
		Если ТипЗнч(ДанныеДляФормированияЭД.ДокументыОснования) = Тип("Массив") Тогда
			Для Каждого Документ Из ДанныеДляФормированияЭД.ДокументыОснования Цикл
				ТипДокумента = ТипЗнч(Документ);
				Если ТипДокумента = Тип("ДокументСсылка.РасходнаяНакладная")
					Или ТипДокумента = Тип("ДокументСсылка.КорректировкаРеализации")
					Или ТипДокумента = Тип("ДокументСсылка.ПередачаТоваровМеждуОрганизациями") Тогда
					
					ДокументРеализации = Документ;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ДокументРеализации) Тогда
			Возврат;
		КонецЕсли;
		
		СтруктураАдресов.Продавец.УчастникОбмена   = ДанныеШапки.Поставщик;
		СтруктураАдресов.Покупатель.УчастникОбмена = ДанныеШапки.Покупатель;
		
		Если ЗначениеЗаполнено(ДанныеШапки.Грузополучатель)
			И Не ВидыКИПоТипамВладельцев.Получить(ТипЗнч(ДанныеШапки.Грузополучатель)) = Неопределено Тогда
			ОбъектПокупатель                                              = ДанныеШапки.Грузополучатель;
			СтруктураАдресов.Покупатель.УполномоченноеЛицоЗаПоставкуГруза = ОбъектПокупатель;
		Иначе
			ОбъектПокупатель = ДанныеШапки.Покупатель;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДанныеШапки.Грузоотправитель)
			И Не ВидыКИПоТипамВладельцев.Получить(ТипЗнч(ДанныеШапки.Грузоотправитель)) = Неопределено Тогда
			ОбъектПродавец                                              = ДанныеШапки.Грузоотправитель;
			СтруктураАдресов.Продавец.УполномоченноеЛицоЗаПоставкуГруза = ОбъектПродавец;
		Иначе
			ОбъектПродавец = ДанныеШапки.Поставщик;
		КонецЕсли;
		
		ДанныеДокументаРеализации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументРеализации, "СтруктурнаяЕдиница, АдресДоставки, АдресДоставкиЗначение, АдресДоставкиЗначенияПолей");
		Если ЗначениеЗаполнено(ДанныеДокументаРеализации.АдресДоставкиЗначенияПолей) Тогда
			
			СтруктураАдресов.Покупатель.АвтоматическоеЗаполнение = Ложь;
			СтруктураАдресов.Покупатель.АдресСтрокой             = ДанныеДокументаРеализации.АдресДоставки;
			СтруктураАдресов.Покупатель.АдресЗначенияПолей       = ДанныеДокументаРеализации.АдресДоставкиЗначенияПолей;
			
		ИначеЕсли ЗначениеЗаполнено(ДанныеДокументаРеализации.АдресДоставкиЗначение) Тогда
			
			СтруктураАдресов.Покупатель.АвтоматическоеЗаполнение = Ложь;
			СтруктураАдресов.Покупатель.АдресСтрокой             = ДанныеДокументаРеализации.АдресДоставки;
			СтруктураАдресов.Покупатель.АдресЗначениеJSON        = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияВJSON(ДанныеДокументаРеализации.АдресДоставкиЗначение);
			
		Иначе
			
			СтруктураАдресов.Покупатель.АвтоматическоеЗаполнение     = Истина;
			СтруктураАдресов.Покупатель.ВладелецКонтактнойИнформации = ОбъектПокупатель;
			СтруктураАдресов.Покупатель.ВидКонтактнойИнформации      = ВидыКИПоТипамВладельцев.Получить(ТипЗнч(ОбъектПокупатель));
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДанныеДокументаРеализации.СтруктурнаяЕдиница)
			И Не ВидыКИПоТипамВладельцев.Получить(ТипЗнч(ДанныеДокументаРеализации.СтруктурнаяЕдиница)) = Неопределено Тогда
			
			СтруктураАдресов.Продавец.АвтоматическоеЗаполнение = Истина;
			СтруктураАдресов.Продавец.ВладелецКонтактнойИнформации = ДанныеДокументаРеализации.СтруктурнаяЕдиница;
			СтруктураАдресов.Продавец.ВидКонтактнойИнформации      = ВидыКИПоТипамВладельцев.Получить(ТипЗнч(ДанныеДокументаРеализации.СтруктурнаяЕдиница));
			
		Иначе
			
			СтруктураАдресов.Продавец.АвтоматическоеЗаполнение     = Истина;
			СтруктураАдресов.Продавец.ВладелецКонтактнойИнформации = ОбъектПродавец;
			СтруктураАдресов.Продавец.ВидКонтактнойИнформации      = ВидыКИПоТипамВладельцев.Получить(ТипЗнч(ОбъектПродавец));
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Добавить сведения о перевозочных документах в формате УПД 5_02.
// 
// Параметры:
//  СтруктураДанных              - Структура - произвольная структура данных для формирования электронного документа.
//  Источник                     - ДокументСсылка - ссылка на прикладной документ
//  ДанныеПеревозочныхДокументов - см. ЭлектронноеВзаимодействиеИСМП.СтруктураДанныхПоПеревозочнымДокументам
Процедура ДобавитьСведенияОПеревозочныхДокументах_5_02(СтруктураДанных, Источник, ДанныеПеревозочныхДокументов) Экспорт
	
	Если Не ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтруктураДанных, "РеквизитыШапки") Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеДляФормированияЭД = СтруктураДанных;
	ДанныеШапки = СтруктураДанных.РеквизитыШапки;
	
	ДокументРеализации = Неопределено;
	Если ТипЗнч(ДанныеДляФормированияЭД.ДокументыОснования) = Тип("Массив") Тогда
		Для Каждого Документ Из ДанныеДляФормированияЭД.ДокументыОснования Цикл
			ТипДокумента = ТипЗнч(Документ);
			Если ТипДокумента = Тип("ДокументСсылка.РасходнаяНакладная")
				Или ТипДокумента = Тип("ДокументСсылка.ПередачаТоваровМеждуОрганизациями") Тогда
				
				ДокументРеализации = Документ;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДокументРеализации) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументРеализации", ДокументРеализации);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РасходнаяНакладная.Дата КАК Дата,
	|	РасходнаяНакладная.Номер КАК Номер,
	|	РасходнаяНакладная.Ссылка КАК Ссылка,
	|	РасходнаяНакладная.Автомобиль КАК Автомобиль
	|ПОМЕСТИТЬ втДокументРеализации
	|ИЗ
	|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
	|ГДЕ
	|	РасходнаяНакладная.Ссылка = &ДокументРеализации
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПередачаТоваровМеждуОрганизациями.Дата,
	|	ПередачаТоваровМеждуОрганизациями.Номер,
	|	ПередачаТоваровМеждуОрганизациями.Ссылка,
	|	ПередачаТоваровМеждуОрганизациями.Автомобиль
	|ИЗ
	|	Документ.ПередачаТоваровМеждуОрганизациями КАК ПередачаТоваровМеждуОрганизациями
	|ГДЕ
	|	ПередачаТоваровМеждуОрганизациями.Ссылка = &ДокументРеализации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втДокументРеализации.Дата КАК Дата,
	|	втДокументРеализации.Номер КАК Номер,
	|	втДокументРеализации.Ссылка КАК Ссылка,
	|	втДокументРеализации.Автомобиль КАК Автомобиль,
	|	ТТНИсходящаяЕГАИС.НомерТТН КАК НомерТранспортногоДокумента,
	|	ТТНИсходящаяЕГАИС.ДатаТТН КАК ДатаТранспортногоДокумента,
	|	ТранспортныеСредства.Код КАК РегНомерТС
	|ИЗ
	|	втДокументРеализации КАК втДокументРеализации
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ТТНИсходящаяЕГАИС КАК ТТНИсходящаяЕГАИС
	|		ПО втДокументРеализации.Ссылка = ТТНИсходящаяЕГАИС.ДокументОснование
	|			И (ТТНИсходящаяЕГАИС.Проведен)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТранспортныеСредства КАК ТранспортныеСредства
	|		ПО втДокументРеализации.Автомобиль = ТранспортныеСредства.Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	ЗаполнитьЗначенияСвойств(ДанныеПеревозочныхДокументов, Выборка);
	
	Если Не ЗначениеЗаполнено(ДанныеПеревозочныхДокументов.НомерТранспортногоДокумента) Тогда
		
		ДанныеПеревозочныхДокументов.НомерТранспортногоДокумента = ПрефиксацияОбъектовКлиентСервер.УдалитьПрефиксыИзНомераОбъекта(Выборка.Номер, Истина, Истина);
		ДанныеПеревозочныхДокументов.ДатаТранспортногоДокумента  = Выборка.Дата;
		
		Запрос = Новый Запрос;
		Запрос.Текст = Обработки.ЭлектронныеПеревозочныеДокументы.ЗапросПоДокументуОснования();
		
		Обработки.ЭлектронныеПеревозочныеДокументы.ЗаполнитьОбязательныеПараметрыЗапроса(Запрос.Параметры);
		
		Запрос.УстановитьПараметр("ДокументОснование", ДокументРеализации);
		Запрос.УстановитьПараметр("НачалоПериода",     Дата(1, 1, 1));
		Запрос.УстановитьПараметр("КонецПериода",      Дата(1, 1, 1));
		
		УстановитьПривилегированныйРежим(Истина);
		ВыборкаЭПД = Запрос.Выполнить().Выбрать();
		УстановитьПривилегированныйРежим(Ложь);
		
		Если ВыборкаЭПД.Следующий() Тогда
			
			ДанныеПеревозочныхДокументов.ИдентификаторЭПД = ВыборкаЭПД.НомерЭПД;
			
			ДанныеФормирования                      = ОбменСГИСЭПД.ДанныеРеквизитовЭПД(ВыборкаЭПД.Ссылка);
			ДанныеПеревозочныхДокументов.РегНомерТС = ДанныеФормирования.ТитулГрузоотправителяТранспортноеСредствоРегистрационныйНомер;
			
			РеквизитыДокументаЭПД = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ВыборкаЭПД.Ссылка, "УИДМинтранс, ТитулГрузоотправителяИдентификаторФайла");
			
			Если ЗначениеЗаполнено(РеквизитыДокументаЭПД.УИДМинтранс) Тогда
				ИдентификаторДокумента = РеквизитыДокументаЭПД.УИДМинтранс;
			Иначе
				ИдентификаторДокумента = РеквизитыДокументаЭПД.ТитулГрузоотправителяИдентификаторФайла;
			КонецЕсли;
			
			ДанныеПеревозочныхДокументов.ИдентификаторЭПД = ИдентификаторДокумента;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Заполнить данные по отправителю и получателю при перемещении между МОД в формате УПД 5_02.
// 
// Параметры:
//  СтруктураДанных - см. Документы.ПеремещениеМеждуМОДИСМП.СтруктураДанныхЮрФизЛица
//  Источник - ОпределяемыйТип.УчастникПеремещенияМеждуМОД
//  ДатаСведений - Дата - дата получения данных
//  ДополнительныеПараметры - Структура - произвольные данные для уточнения данных по отправителю/получателю.
Процедура ЗаполнитьДанныеУчастниковПеремещенияМеждуМОД_5_02(СтруктураДанных, Источник, ДатаСведений = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	
	Организация = Неопределено;
	Если ТипЗнч(Источник) = Тип("СправочникСсылка.СтруктурныеЕдиницы") Тогда
		ДанныеСтруктурнойЕдиницы = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Источник, "Организация, КПП");
		Организация = ДанныеСтруктурнойЕдиницы.Организация;
		СтруктураДанных.КПП = ДанныеСтруктурнойЕдиницы.КПП;
	ИначеЕсли ТипЗнч(Источник) = Тип("СправочникСсылка.Организации") Тогда
		Организация = Источник;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Организации.ЮридическоеФизическоеЛицо КАК ЮридическоеФизическоеЛицо,
	|	Организации.Наименование КАК Наименование,
	|	Организации.НаименованиеПолное КАК НаименованиеПолное,
	|	Организации.ИНН КАК ИНН,
	|	Организации.КПП КАК КПП,
	|	Организации.КодПоОКПО КАК КодПоОКПО,
	|	Организации.НаименованиеСокращенное КАК НаименованиеСокращенное,
	|	Организации.ОГРН КАК ОГРН,
	|	Организации.СвидетельствоСерияНомер КАК СвидетельствоСерияНомер,
	|	Организации.СвидетельствоДатаВыдачи КАК СвидетельствоДатаВыдачи,
	|	ФИОФизическихЛицСрезПоследних.Фамилия КАК Фамилия,
	|	ФИОФизическихЛицСрезПоследних.Имя КАК Имя,
	|	ФИОФизическихЛицСрезПоследних.Отчество КАК Отчество
	|ИЗ
	|	Справочник.Организации КАК Организации
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизическихЛиц.СрезПоследних КАК ФИОФизическихЛицСрезПоследних
	|		ПО Организации.ФизическоеЛицо = ФИОФизическихЛицСрезПоследних.ФизическоеЛицо
	|ГДЕ
	|	Организации.Ссылка = &Организация";
	
	ЗначенияРеквизитов = Запрос.Выполнить().Выбрать();
	ЗначенияРеквизитов.Следующий();
	
	ЗаполнитьЗначенияСвойств(СтруктураДанных, ЗначенияРеквизитов,, "КПП");
	Если Не ЗначениеЗаполнено(СтруктураДанных.КПП) Тогда
		СтруктураДанных.КПП = ЗначенияРеквизитов.КПП;
	КонецЕсли;
	
	СтруктураДанных.ПолноеНаименование      = ЗначенияРеквизитов.НаименованиеПолное;
	СтруктураДанных.СокращенноеНаименование = ЗначенияРеквизитов.НаименованиеСокращенное;
	
КонецПроцедуры

// Процедура осуществляет заполнение переопределяемых данных для формирования электронного документа
//  по документу Перемещение между МОД ИСМП. Осуществляется запись СтруктураДанных данными из номенклатуры.
//
// Параметры:
//  СтруктураДанных - Соответствие из КлючИЗначение:
//  	* Ключ - Число - идентификатор строки из таблицы ТаблицаДляПолученияДанных. Является уникальным идентификатором для
//  		определения полученных данных
//  	* Значение - см. ЭлектронноеВзаимодействиеИСМП.СтруктураДанныхПоНоменклатуреДляФормированияЭД
//  ТаблицаДляПолученияДанных - см. ЭлектронноеВзаимодействиеИСМП.ТаблицаДляПолученияДанныхДляФормированияЭлектронногоДокумента
//  Документ                  - ДокументСсылка.ПеремещениеМеждуМОДИСМП - ссылка на документ.
Процедура ПриПолученииДанныхПоНоменклатуреДляФормированияЭлектронногоДокументаПоПеремещениюМеждуМОДИСМП(СтруктураДанных, ТаблицаДляПолученияДанных, Документ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ТаблицаДанных.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|	ТаблицаДанных.Номенклатура        КАК Номенклатура,
		|	ТаблицаДанных.Характеристика      КАК Характеристика,
		|	ТаблицаДанных.Упаковка            КАК Упаковка
		|ПОМЕСТИТЬ ВТ_ТаблицаДляПолученияДанных
		|ИЗ
		|	&ТаблицаДанных КАК ТаблицаДанных
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТаблицаДляПолученияДанных.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|	ВТ_ТаблицаДляПолученияДанных.Номенклатура        КАК Номенклатура,
		|	ВТ_ТаблицаДляПолученияДанных.Характеристика      КАК Характеристика,
		|	ВТ_ТаблицаДляПолученияДанных.Упаковка            КАК Упаковка,
		|	СписокНоменклатура.ЕдиницаИзмерения              КАК ЕдиницаИзмеренияНоменклатуры,
		|	СписокНоменклатура.НаименованиеПолное            КАК НоменклатураНаименованиеПолное,
		|	СписокНоменклатура.Код                           КАК НоменклатураКод
		|ПОМЕСТИТЬ ВТ_ДанныеПоНоменклатуре
		|ИЗ
		|	ВТ_ТаблицаДляПолученияДанных КАК ВТ_ТаблицаДляПолученияДанных
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СписокНоменклатура
		|		ПО СписокНоменклатура.Ссылка = ВТ_ТаблицаДляПолученияДанных.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ИтоговаяТаблица.ИдентификаторСтроки            КАК ИдентификаторСтроки,
		|	ВТ_ИтоговаяТаблица.Номенклатура                   КАК Номенклатура,
		|	ВТ_ИтоговаяТаблица.НоменклатураНаименованиеПолное КАК НоменклатураНаименованиеПолное,
		|	ВТ_ИтоговаяТаблица.НоменклатураКод                КАК НоменклатураКод,
		|	ВТ_ИтоговаяТаблица.ЕдиницаИзмеренияНоменклатуры   КАК ЕдиницаИзмерения,
		|	СписокЕдиницыИзмерения.Наименование               КАК ЕдиницаИзмеренияНаименование,
		|	СписокЕдиницыИзмерения.Код                        КАК ЕдиницаИзмеренияКод,
		|	ВТ_ИтоговаяТаблица.Упаковка                       КАК Упаковка,
		|	СписокУпаковки.Наименование                       КАК УпаковкаНаименование,
		|	СписокУпаковки.ЕдиницаИзмеренияПоКлассификатору.Код КАК УпаковкаКод
		|ИЗ
		|	ВТ_ДанныеПоНоменклатуре КАК ВТ_ИтоговаяТаблица
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЕдиницыИзмерения КАК СписокУпаковки
		|		ПО ВТ_ИтоговаяТаблица.Упаковка = СписокУпаковки.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторЕдиницИзмерения КАК СписокЕдиницыИзмерения
		|		ПО ВТ_ИтоговаяТаблица.ЕдиницаИзмеренияНоменклатуры = СписокЕдиницыИзмерения.Ссылка";
	
	Запрос.УстановитьПараметр("ТаблицаДанных", ТаблицаДляПолученияДанных);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		СтруктураДанныхПоНоменклатуре = ЭлектронноеВзаимодействиеИСМП.СтруктураДанныхПоНоменклатуреДляФормированияЭД();
		
		СтруктураДанныхПоНоменклатуре.НалоговаяСтавка                = УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДСБезНДС();
		СтруктураДанныхПоНоменклатуре.НоменклатураКод                = ВыборкаДетальныеЗаписи.НоменклатураКод;
		СтруктураДанныхПоНоменклатуре.НоменклатураНаименованиеПолное = ВыборкаДетальныеЗаписи.НоменклатураНаименованиеПолное;
		
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Упаковка) Тогда
			
			СтруктураДанныхПоНоменклатуре.ЕдиницаИзмерения               = ВыборкаДетальныеЗаписи.Упаковка;
			СтруктураДанныхПоНоменклатуре.ЕдиницаИзмеренияКод            = ?(ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.УпаковкаКод), ВыборкаДетальныеЗаписи.УпаковкаКод, "0000");
			СтруктураДанныхПоНоменклатуре.ЕдиницаИзмеренияНаименование   = ВыборкаДетальныеЗаписи.УпаковкаНаименование;
			
		Иначе
			
			СтруктураДанныхПоНоменклатуре.ЕдиницаИзмерения               = ВыборкаДетальныеЗаписи.ЕдиницаИзмерения;
			СтруктураДанныхПоНоменклатуре.ЕдиницаИзмеренияКод            = ВыборкаДетальныеЗаписи.ЕдиницаИзмеренияКод;
			СтруктураДанныхПоНоменклатуре.ЕдиницаИзмеренияНаименование   = ВыборкаДетальныеЗаписи.ЕдиницаИзмеренияНаименование;
			
		КонецЕсли;
		
		СтруктураДанных.Вставить(ВыборкаДетальныеЗаписи.ИдентификаторСтроки, СтруктураДанныхПоНоменклатуре);
		
	КонецЦикла;
	
КонецПроцедуры

// Процедура осуществляет проверку на заполнение акцизных марок при формировании ЭД.
// 
// Параметры:
//  Источник                  - ДокументСсылка - ссылка на документ
//  Отказ                     - Булево - Истина, если проверка на заполнение акцизных марок не пройдена
//  ВыдаватьСообщенияОбОшибке - Булево - Выдавать сообщения об ошибке
//  СтандартнаяОбработка      - Булево - признак стандартной обработки.
Процедура ПроверитьЗаполнениеЭлектронногоДокументаНаАкцизныеМарки(Источник, Отказ, ВыдаватьСообщенияОбОшибке = Истина, СтандартнаяОбработка = Истина) Экспорт
	
	Возврат;
	
КонецПроцедуры

#Область УстаревшиеПроцедурыИФункции

// Устарела. При необходимости перед формированием документа ЭДО выполняет проверку соответствия маркируемой продукции и
// товарной части документа.
//
// Параметры:
//  Ссылка - ДокументСсылка - проверяемый документ
//  Отказ  - Булево - флаг отказа от дальнейших действий
Процедура ПроверитьМаркируемуюПродукциюДокумента(Ссылка, Отказ) Экспорт
	
	Если Не ИнтеграцияМОТПУНФ.ПроверитьМаркируемуюПродукциюДокумента(Ссылка) Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

// Процедуры и функции для работы с другими версиями БЭД
//
#Область СлужебныйПрограммныйИнтерфейс

// Для встраивания УПП
// Предназначена для формирования конструктора параметров обработки ошибок
//
// Параметры:
//  ПараметрыОбработкиОшибки - см. ОбщегоНазначенияБЭДКлиентСервер.НовыеПараметрыОшибки
//  СтандартнаяОбработка     - Булево - признак стандартной обработки (установить Ложь для переопределенных)
//  КлючДанных			     - ЛюбаяСсылка - ключ данных для обработки через сообщение пользователю (см. СообщениеПользователю).
//  ПутьКДанным			     - Строка - путь к данным для обработки через сообщение пользователю (см. СообщениеПользователю).
//  НавигационнаяСсылка	     - Строка - навигационная ссылка, по которой нужно перейти при клике на ошибку.
//  ИмяФормы			     - Строка - имя формы, которую нужно открыть при клике на ошибку.
//  ПараметрыФормы		     - Структура - параметры, передаваемые в форму, открываемую при клике на ошибку.
//  ТекстОшибки			     - Строка - используется для переопределения стандартного текста ошибки.
//
Процедура НовыеПараметрыОбработкиОшибки(ПараметрыОбработкиОшибки, СтандартнаяОбработка, КлючДанных = Неопределено, ПутьКДанным = "", НавигационнаяСсылка = "", ИмяФормы = "",
	ПараметрыФормы = Неопределено, ТекстОшибки = "") Экспорт

	Возврат;

КонецПроцедуры

// Для встраивания УПП
// Предназначена для заполнения обработки ошибок в строке дерева значений
// 
// Параметры:
//  СтрокаДерева             - СтрокаДереваЗначений - строка дерева данных
//  ПараметрыОбработкиОшибок - см. ПараметрыОбработкиОшибки
//  СтандартнаяОбработка - Булево         - признак стандартной обработки (установить Ложь для переопределенных)
//
Процедура ПриЗаполненииПараметровОбработкиОшибокВСтрокеДерева(СтрокаДерева, ПараметрыОбработкиОшибок, СтандартнаяОбработка) Экспорт
	
	Возврат;
	
КонецПроцедуры

// Для встраивания УПП
// Предназначена для получения значения из дерева значений по полному пути.
// (См. ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве)
//
// Параметры:
//  ЗначениеРеквизита    - Произвольный   - найденное значения.
//  ДеревоДанных         - ДеревоЗначений - объект поиска.
//  ПолныйПуть           - Строка         - значение поиска.
//  СтандартнаяОбработка - Булево         - признак стандартной обработки (установить Ложь для переопределенных)
// 
Процедура ПриОпределенииЗначенияРеквизитаВДереве(ЗначениеРеквизита, ДеревоДанных, ПолныйПуть, СтандартнаяОбработка) Экспорт
	
	Возврат;
	
КонецПроцедуры

// Для встраивания УПП
// Предназначена для получения данных элемента дерева, находящегося по указанному пути.
// (См. ЭлектронноеВзаимодействие.ДанныеЭлементаДереваЭлектронногоДокумента)
//
// Параметры:
//  ЗначениеРеквизита    - Произвольный   - найденное значения.
//  ДеревоДанных - ДеревоЗначений - область данных поиска.
//  ПолныйПуть - Строка - полный путь к реквизиту. Составляющие пути разделяются точками.
//  СтандартнаяОбработка - Булево         - признак стандартной обработки (установить Ложь для переопределенных)
// 
Процедура ПриОпределенииДанныхЭлементаДереваЭлектронногоДокумента(ЗначениеРеквизита, ДеревоДанных, ПолныйПуть, СтандартнаяОбработка) Экспорт
	
	Возврат;
	
КонецПроцедуры

// Для встраивания УПП
// Предназначена для вывода ошибки заполнения ЭД пользователю
//   (См. ЭлектронноеВзаимодействие.ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю)
//
// Параметры:
//   СтрокиТаблицы - Массив из СтрокаТаблицыЗначений, ТаблицаЗначений - см. ЭлектронноеВзаимодействие.ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю.СтрокиТаблицы.
//   ПолеТаблицы   - Строка                 - см. ЭлектронноеВзаимодействие.ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю.ПолеТаблицы.
//   КлючДанных    - Строка, ЛюбаяСсылка    - см. ЭлектронноеВзаимодействие.ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю.КлючДанных.
//   ПутьКДанным   - Строка                 - см. ЭлектронноеВзаимодействие.ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю.ПутьКДанным.
//   ТекстОшибки   - Строка                 - см. ЭлектронноеВзаимодействие.ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю.ТекстОшибки
//   СтандартнаяОбработка - Булево - признак стандартной обработки (установить Ложь для переопределенных)
//
Процедура ПриВыводеОшибкиЗаполненияПользователю(СтрокиТаблицы, ПолеТаблицы, КлючДанных, ПутьКДанным, ТекстОшибки, СтандартнаяОбработка) Экспорт

	Возврат;

КонецПроцедуры

// Для встраивания УПП
// Записывает данные из структуры в группу дерева значений.
// (См. ЭлектронноеВзаимодействие.ПриЗагрузкеСтруктурыВГруппуДерева)
//
// Параметры:
//  Дерево - ДеревоЗначений - дерево данных, в котором необходимо сохранить данные
//  СтруктураДанных - Структура - данные, которые должны быть загружены в группу
//  Путь - Строка - название группы в дереве.
//   СтандартнаяОбработка - Булево - признак стандартной обработки (установить Ложь для переопределенных)
//
Процедура ПриЗагрузкеСтруктурыВГруппуДерева(Дерево, СтруктураДанных, Путь, СтандартнаяОбработка) Экспорт
	
	Возврат;
	
КонецПроцедуры

// Для встраивания УПП
// Предназначена переопределения имени обработки обмена с контрагентами.
//
//Параметры:
//   Имя - Строка - имя обработки в метаданных.
//
Процедура ПриОпределенииИмениОбработкиОбменаПоЭДО(Имя) Экспорт

	Возврат;

КонецПроцедуры

// Для встраивания УПП
// Предназначена для переопределения получения установки значения в дереве по полному пути.
// (См. ЭлектронноеВзаимодействие.ЗагрузитьТаблицуВДерево)
//
// Параметры:
//  Дерево - ДеревоЗначений - дерево данных, в котором необходимо сохранить данные.
//  ТаблицаДанных - таблицаЗначений - записываемые в дерево данные. Таблица может предварительно дополняться данными
//                                    для обработки ошибок:
//                                    см. ЭлектронноеВзаимодействие.ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю,
//                                    ЭлектронноеВзаимодействие.ДобавитьВТаблицуОбработкуОшибкиЧерезНавигационнуюСсылку,
//                                    ЭлектронноеВзаимодействие.ДобавитьВТаблицуОбработкуОшибкиЧерезОткрытиеФормы.
//  
//  НазваниеТаблицы - Строка - название таблицы в дереве.
//  СтандартнаяОбработка - Булево - признак стандартной обработки.
//
Процедура ПриЗагрузкеТаблицыВДерево(Дерево, ТаблицаДанных, НазваниеТаблицы, СтандартнаяОбработка) Экспорт
	
	Возврат;
	
КонецПроцедуры

// Для встраивания УПП
// Преназначена для переопределения установки значения реквизита в дереве.
// (См. ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве)
//
// Параметры:
//  Дерево - ДеревоЗначений, СтрокаДереваЗначений - дерево, содержащее данные электронного документа
//  Реквизит - Строка - содержит полный путь к реквизиту дерева.
//  Значение - Произвольный - сохраняемое в дереве значение.
//  ПараметрыОбработкиОшибок - Строка - используется, чтобы переопределить текст выводимой по реквизиту ошибки
//                                      без указания параметров действий по клику на ошибке.
//                           - Структура - используется для указания указания параметров действий по клику на ошибке,
//                                         формируется функцией ЭлектронноеВзаимодействиеКлиентСервер.НовыеПараметрыОбработкиОшибки.
//  СтандартнаяОбработка - Булево - признак стандартной обработки.
//
Процедура ПриЗаполненииЗначенияРеквизитаВДереве(Дерево, Реквизит, Значение, ПараметрыОбработкиОшибок, СтандартнаяОбработка) Экспорт
	
	Возврат;
	
КонецПроцедуры

// Для встраивания УПП
// Возвращает строку дерева значений для заполнения в прикладном решении.
// (См. ЭлектронноеВзаимодействие.СтрокаДерева)
// Параметры:
//  ЗначениеСтроки - Произвольный   - найденное значение.
//  Дерево - ДеревоЗначений - дерево с данными
//  НазваниеПоля - Строка - название поля в дереве, содержащее полный путь к реквизиту
//  НайтиРекурсивно - Булево - если требуется рекурсивный поиск.
//  СтандартнаяОбработка - Булево - признак стандартной обработки.
//
Процедура ПриПолученииСтрокиДерева(ЗначениеСтроки, Дерево, НазваниеПоля, НайтиРекурсивно, СтандартнаяОбработка) Экспорт
	
	Возврат;
	
КонецПроцедуры

// Для встраивания УПП
// Предназначена для добавления записей в таблицу дерева.
// (См. ДеревоЭлектронногоДокументаБЭД.ДобавитьЗаписьВТаблицуДерева)
//
// Параметры:
//  Дерево - ДеревоЗначений, СтрокаДереваЗначений - дерево, содержащее данные электронного документа
//  НоваяСтрока - Структура, СтрокаТаблицыЗначений - коллекция для сохранения в дереве
//  НазваниеТаблицы - Строка - название таблицы в дереве
//  СтандартнаяОбработка - Булево - признак стандартной обработки.
// 
Процедура ПриДобавленииЗаписиВТаблицуДерева(Дерево, НоваяСтрока, НазваниеТаблицы, СтандартнаяОбработка) Экспорт
	
	Возврат;
	
КонецПроцедуры

// Для встраивания УПП
// Предназначена для переопределения текста запроса для получения учетной записи ЭДО по установленному отбору.
// 
// Параметры:
// 	Запрос - Запрос - запрос на получение учетной записи по отбору
// 	ТекстыЗапросов - СписокЗначений из Строка - список значений с текстами запроса
// 	ИмяВременнойТаблицы - Строка - имя временной таблицы для выборки учетных записей
// 	Отбор - Структура:
// 		* УчетныеЗаписи - Строка - параметр или выражение для отбора по идентификаторам учетных записей
// 		* Организация - Строка - параметр или выражение для отбора по организации
// 		* СпособОбмена - Строка - параметр или выражение для отбора по способу обмена
// 		* Оператор - Строка - параметр или выражение для отбора по оператору
// 		* ЭтоОблачныйЭДО - Неопределено, Булево - параметр или выражение для отбора по использованию обмена через облачный ЭДО.
// 	СтандартнаяОбработка - Булево - признак стандартной обработки.
// 	
Процедура ПриПолученииУчетныхЗаписейЭДОСОтбором(Запрос, ТекстыЗапросов, ИмяВременнойТаблицы, Отбор, СтандартнаяОбработка) Экспорт
	
	Возврат;
	
КонецПроцедуры

// Для встраивания УПП
// Предназначена для переопределения проверки поддержки выбранного формата по пространству имен.
// 
// Параметры:
//  ФорматУПД - Строка - пространство имен формата.
//  ЭтоПоддерживаемыйФормат - Булево - Истина, если поддерживается выбранный формат.
//  СтандартнаяОбработка - Булево - признак стандартной обработки.
//
Процедура ПриОпределенииПоддержкиФорматаЭДО(ФорматУПД, ЭтоПоддерживаемыйФормат, СтандартнаяОбработка) Экспорт
	
	Возврат;
	
КонецПроцедуры

// Для встраивания УПП
// Предназначена для переопределения получения дерева данных для заполнения или чтения прикладным решением.
// (См. ЭлектронноеВзаимодействие.ДеревоЭлектронногоДокумента)
//
// Параметры:
//   ПутьКМакетуДанныхЭД - Строка - путь к макету в формате "ИмяОбработки.ИмяМакета", например,
//                         "ОбменСКонтрагентами.Акт501_Исполнитель" (см. Обработка.ОбменСКонтрагентами.Макеты).
// 
//   ДеревоДанных - ДеревоЗначений - Дерево электронного документа.
//   СтандартнаяОбработка - Булево - признак стандартной обработки.
//
Процедура ПриПолученииДереваЭлектронногоДокумента(ПутьКМакетуДанныхЭД, ДеревоДанных, СтандартнаяОбработка) Экспорт
	
	Возврат;
	
КонецПроцедуры

// Для встраивания УПП
// Предназначена для переопределения формирования сообщения отправителя.
// 
// Параметры:
//  ДанныеСообщения - Структура из КлючИЗначение:
//  	* Отказ                  - Булево - Истина, если в процессе формирования выявились ошибки
//  	* ТекстОшибки            - Строка - общий текст ошибки
//  	* МассивОшибокЗаполнения - Массив из Строка - массив ошибок формирования
//  	* ДвоичныеДанныеФайла    - ДвоичныеДанные, Неопределено - данные сформированного титула в формате XML
//  	* ИмяФайла               - Строка - имя файла ЭД. - Титул продавца в формате 5_02.
//  ДеревоДанных - ДеревоЗначений - данные сформированного дерева ЭД
//  СтруктураЭД - Структура из КлючИЗначение:
//  	* Функция - Строка - функция ЭД
//  	* ФорматУПД - Строка - пространство имен УПД
//  	* ОбъектУчета - ДокументСсылка - ссылка на документ
//  	* Организация - ОпределяемыйТип.Организация - организация
//  ИдентификаторОтправителя - Строка - идентификатор настройки ЭДО отправителя
//  ИдентификаторПолучателя - Строка - идентификатор настройки ЭДО получателя
//  СтандартнаяОбработка - Булево - признак стандартной обработки.
Процедура ПриФормированииДанныхСообщенияОтправителя(ДанныеСообщения, ДеревоДанных, СтруктураЭД, ИдентификаторОтправителя, ИдентификаторПолучателя, СтандартнаяОбработка) Экспорт
	
	Возврат;
	
КонецПроцедуры

// Для встраивания УПП
// Предназначена для переопределения формирования сообщения получателя.
// 
// Параметры:
//  ДанныеСообщения - Структура из КлючИЗначение:
//  	* Отказ                  - Булево - Истина, если в процессе формирования выявились ошибки
//  	* ТекстОшибки            - Строка - общий текст ошибки
//  	* МассивОшибокЗаполнения - Массив из Строка - массив ошибок формирования
//  	* ДвоичныеДанныеФайла    - ДвоичныеДанные, Неопределено - данные сформированного титула в формате XML
//  	* ИмяФайла               - Строка - имя файла ЭД. - Титул покупателя в формате 5_02.
//  ДанныеОтветногоТитула - Структура из КлючИЗначение:
//  	* ДеревоДанных - ДеревоЗначений - данные сформированного дерева ЭД
//  	* Формат - Строка
//  СтруктураЭД - Структура из КлючИЗначение:
//  	* ОбъектУчета - ДокументСсылка - ссылка на документ
//  	* ДвоичныеДанныеФайла - ДвоичныеДанные - двоичные данные титула продавца
//  	* ИмяФайлаБезРасширения - Строка - имя файла титула продавца
//  ИдентификаторОтправителя - Строка - идентификатор настройки ЭДО отправителя
//  ИдентификаторПолучателя - Строка - идентификатор настройки ЭДО получателя
//  СтандартнаяОбработка - Булево - признак стандартной обработки.
Процедура ПриФормированииДанныхСообщенияПолучателя(ДанныеСообщения, ДанныеОтветногоТитула, СтруктураЭД, ИдентификаторОтправителя, ИдентификаторПолучателя, СтандартнаяОбработка) Экспорт
	
	Возврат;
	
КонецПроцедуры

// Для встраивания УПП
// Предназначена для переопределения процедуры формирования дерева ответного титула покупателя.
// 
// Параметры:
//  СтруктураДанных - Структура из КлючИЗначение:
//		* ДеревоДанных - ДеревоЗначений
//		* Формат - Строка - формат ответного титула.
//  ОбъектУчета - ДокументСсылка - ссылка на документ
//  ИмяФайла - Строка - имя файла титула продавца
//  ДвоичныеДанныеФайла - ДвоичныеДанные - данные файла титула продавца
//  СтандартнаяОбработка - Булево - признак стандартной обработки.
Процедура ПриФормированииДереваОтветногоТитулаПокупателя(СтруктураДанных, ОбъектУчета, ИмяФайла, ДвоичныеДанныеФайла, СтандартнаяОбработка) Экспорт
	
	Возврат;
	
КонецПроцедуры

// Для встраивания УПП
// Предназначена для переопределения заполнения подписанта и ЭП в титулах продавца и покупателя.
// 
// Параметры:
//  Организация - ОпределяемыйТип.Организация
//  ДвоичныеДанные - ДвоичныеДанные - дополненный итоговый ЭД с ЭП и подписантами
//	ОписаниеФайла - Структура из КлючИЗначение:
//		* ДвоичныеДанные - ДвоичныеДанные - данные ЭД
//		* ИмяФайла - Строка - имя файла ЭД
//  СертификатПодписи - СправочникСсылка.СертификатыКлючейЭлектроннойПодписиИШифрования - сертификат подписанта
//  ПодписьПродавца - Неопределено, ДвоичныеДанные - Подпись продавца
//	ВыбраннаяМЧД - Неопределено, СправочникСсылка.МашиночитаемыеДоверенности - МЧД подписанта
//  СтандартнаяОбработка - Булево - признак стандартной обработки.
Процедура ПриЗаполненииПодписантаИЭлектроннойПодписи(Организация, ДвоичныеДанные, ОписаниеФайла, СертификатПодписи, ПодписьПродавца, ВыбраннаяМЧД, СтандартнаяОбработка) Экспорт
	
	Возврат;
	
КонецПроцедуры

// Для встраивания УПП
// Предназначена для переопределения МЧД по сертификату для подписи.
// 
// Параметры:
//  Организация - ОпределяемыйТип.Организация
//  СертификатПодписи - СправочникСсылка.СертификатыКлючейЭлектроннойПодписиИШифрования - сертификат подписанта
//	ВыбраннаяМЧД - Неопределено, СправочникСсылка.МашиночитаемыеДоверенности - МЧД подписанта
//  СтандартнаяОбработка - Булево - признак стандартной обработки.
Процедура ПриЗаполненииМашиночитаемойДоверенности(Организация, СертификатПодписи, ВыбраннаяМЧД, СтандартнаяОбработка) Экспорт
	
	Возврат;
	
КонецПроцедуры

// Для встраивания УПП
// Предназначена для переопределения двоичных данных на основании дерева данных ЭД.
// 
// Параметры:
//  Организация - ОпределяемыйТип.Организация
//  ДвоичныеДанные - ДвоичныеДанные - дополненный итоговый ЭД с ЭП и подписантами
//	ДанныеФайлаЭД - ДеревоЗначений - дерево ЭД
//  СтандартнаяОбработка - Булево - признак стандартной обработки.
Процедура СформироватьДвоичныеДанныеИзФайлаЭД(ДвоичныеДанные, ДанныеФайлаЭД, СтандартнаяОбработка) Экспорт
	
	Возврат;
	
КонецПроцедуры

// Для встраивания УПП
// Предназначена для переопределения получения дерева по объекту учета.
//
// Параметры:
//  ОбъектУчета - ДокументСсылка.ПеремещениеМеждуМОДИСМП
//  СтруктураЭД - Структура из КлючИЗначение:
//  	* Функция - Строка - функция ЭД
//  	* ФорматУПД - Строка - пространство имен формата ЭД
//  	* ОбъектУчета - ДокументСсылка.ПеремещениеМеждуМОДИСМП
//  	* Организация - ОпределяемыйТип.Организация
//  	* ИдентификаторОтправителя - Строка
//  	* ИдентификаторПолучателя - Строка
//  ДеревоДанных - ДеревоЗначений
//  СтандартнаяОбработка - Булево - признак стандартной обработки.
Процедура ПриПолученииДереваПоОписаниюДанныхОбъектаУчета(ОбъектУчета, СтруктураЭД, ДеревоДанных, СтандартнаяОбработка) Экспорт
	
	Возврат;
	
КонецПроцедуры

// Для встраивания УПП
// Предназначена для переопределения сообщения отправителя по электронному документу.
// 
// Параметры:
//  ЭлектронныйДокумент - ДокументСсылка.ЭлектронныйДокументИсходящийЭДО
//                        - ДокументСсылка.ЭлектронныйДокументВходящийЭДО
//  Сообщение            - ДокументСсылка.СообщениеЭДО
//  СтандартнаяОбработка - Булево - признак стандартной обработки.
Процедура ПриПолученииСообщенияОтправителя(ЭлектронныйДокумент, Сообщение, СтандартнаяОбработка) Экспорт
	
	Возврат;
	
КонецПроцедуры

// Для встраивания УПП
// Предназначена для переопределения двоичных данных представления сообщения.
// 
// Параметры:
//  Сообщение - ДокументСсылка.СообщениеЭДО
//  ДвоичныеДанныеСообщения - ДвоичныеДанные
//  ВызыватьИсключение - Булево
//  СтандартнаяОбработка - Булево - признак стандартной обработки.
Процедура ПриПолученииДвоичныхДанныхСообщения(Сообщение, ДвоичныеДанныеСообщения, ВызыватьИсключение, СтандартнаяОбработка) Экспорт
	
	Возврат;
	
КонецПроцедуры

// Для встраивания УПП
// Предназначена для переопределения статуса документооборота.
// 
// Параметры:
//  Объект - ОпределяемыйТип.ОснованияЭлектронныхДокументовЭДО - ссылка на объект ИБ по которому нужно получить статус документооборота.
//  		 - ДокументСсылка.ЭлектронныйДокументИсходящийЭДО - ссылка на исходящий электронный документ.
//  		 - ДокументСсылка.ЭлектронныйДокументВходящийЭДО - ссылка на входящий электронный документ.
// 
// Результат - Структура - описание статуса электронного документооборота:
//   * Статус - Строка - возможные значения:
//     "ЭДОНеНастроен"         - между участниками не завершена процедура настройки ЭДО.
//     "НеНачат"               - электронный документ по учетному не обнаружен.
//     "ВОбработке"            - охватывает время жизни исходящего электронного документа от создания до получения от
//                               контрагента решения (утверждения или отклонения).
//     "Получен"               - входящий электронный документ получен.
//     "ОтклонениеВОбработке"  - для входящих: документ отклонен, но уведомление не подписано или не отправлено.
//                               при аннулировании (и исходящих, и входящих): ответ по предложению об аннулированию
//                               еще не получен.
//     "Отклонен"              - документооборот завершен с отклонением.
//     "УтверждениеВОбработке" - входящий электронный документ утвержден, но ответный титул (ответная подпись)
//                               не подписан или не отправлен.
//     "Утвержден"             - документооборот успешно завершен.
//     "Ошибка"                - при проведении ЭДО произошла ошибка.
//   * ЭлектронныйДокумент - ДокументСсылка.ЭлектронныйДокументИсходящийЭДО, 
//                           ДокументСсылка.ЭлектронныйДокументВходящийЭДО - ссылка на электронный документ. Если в
//                                          параметре "Документ" передан учетный документ, возвращается актуальный
//                                          для него электронный. Если передан электронный - возвращается та же ссылка.
//                           Неопределено - возвращается, если актуальный электронный документ отсутствует.
//  СтандартнаяОбработка - Булево - признак стандартной обработки.
Процедура ПриПолученииСтатусаДокументооборота(Объект, Результат, СтандартнаяОбработка) Экспорт
	
	Возврат;
	
КонецПроцедуры

// Для встраивания УПП
// Предназначена для переопределения параметров визуализации электронного документа.
// 
// Параметры:
//  ВозвращаемоеЗначение - Структура - Описание:
// * ВыводитьДопДанные - Булево - признак вывода доп. данных.
// * ВыводитьБанковскиеРеквизиты - Булево - признак вывода банковских реквизитов.
// * ВыводитьКопияВерна - Булево - признак вывода области "Копия верна".
// * ВыводитьШапкуСИдДокумента - Булево - признак, позволяющий отключить в шапке вывод идентификатора документа.
// * ПодсказкаQRКода - Строка - подсказка, которая будет выводиться в QR-коде.
// * ПубличнаяСсылкаQRКода - Строка - ссылка, которая будет выводиться в QR-коде. 
//  СтандартнаяОбработка - Булево - признак стандартной обработки.
Процедура ПриОпределенииПараметровВизуализацииЭлектронногоДокумента(ВозвращаемоеЗначение, СтандартнаяОбработка) Экспорт
	
	Возврат;
	
КонецПроцедуры

// Для встраивания УПП
// Предназначена для переопредления визуализации формализованного электронного документа, содержащегося в файле.
// 
// Параметры:
//  СообщениеОтправителя - ДокументСсылка.СообщениеЭДО
// 	ДвоичныеДанныеОсновногоФайла - ДвоичныеДанные - двоичные данные основного файла.
// 	ДвоичныеДанныеОтветногоФайла - ДвоичныеДанные - двоичные данные ответного файла (для 2-х титульных документов)
// 	ПараметрыВизуализации - см. НовыеПараметрыВизуализацииЭлектронногоДокумента.
// 	ТабличныйДокумент - ТабличныйДокумент - табличный документ с визуализацией электронного документа.
//  СтандартнаяОбработка - Булево - признак стандартной обработки.
Процедура ПриОпределенииПредствленияЭлектронногоДокументаПоФайлу(СообщениеОтправителя, ДвоичныеДанныеОсновногоФайла, ДвоичныеДанныеОтветногоФайла, ПараметрыВизуализации, ТабличныйДокумент, СтандартнаяОбработка) Экспорт
	
	Возврат;
	
КонецПроцедуры

// Для встраивания УПП
// Предназначена для переопредления доступности выполнения действий по формированию ЭД.
// 
// Параметры:
//  ПроверкаДоступностиФормированияЭД - Структура из КлючИЗначение:
//    Структура из КлючИЗначение:
//   * ДоступноФормированиеЭД - Булево - Истина, если доступно выполнение действий по ЭДО
//   * ТекстОшибки - Строка - текст ошибки при обработке проверки.
//  СтандартнаяОбработка - Булево - признак стандартной обработки.
Процедура ПриОпределенииДоступностиВыполненияДействийПоЭДО(ПроверкаДоступностиФормированияЭД, СтандартнаяОбработка) Экспорт
	
	Возврат;
	
КонецПроцедуры

#КонецОбласти
